<a href="https://colab.research.google.com/github/dudaspm/IST210-Spring2020/blob/master/SQL/SQLJoins_LetsGoGolfing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Joins and other SQL commands

(As always, before we start. Go to the top of the screen and select "Runtime" and then "Run all")

In this notebook, we will be adding to our SQL commands and practicing the ones we used before as well. 

Also, we will have two tables to work with: 


*   State College Weather (2010 - 2019-12-31)
*   Golfing table (2017 - 2019-10-09)

In [1]:
%load_ext sql
%sql sqlite:///letsgogolfing.db

'Connected: @letsgogolfing.db'

What is the golfing table?

I made up some data based on the state college weather. Based on the conditions, there is a probability that someone will either golf or not golf on a given day.

In [2]:
#Used to make requests
import urllib

f = urllib.request.urlopen("https://gist.githubusercontent.com/dudaspm/2cc247b1b43f1ebf620c1004dd2a0f76/raw/ecdb8dd0f2f851994f10d6612d398702a2d73d4c/StateCollege2010-2020.csv")
StateCollegeWeatherData = str(f.read().decode('utf-8'))
for row in StateCollegeWeatherData.split("\n")[0:5]:
  print (row)
print("\n")
f = urllib.request.urlopen("https://gist.githubusercontent.com/dudaspm/2aa5cf88fe20dc389ba77fc1cc802a11/raw/6aefc1181e01a18c3228a195dc02344d35bd80e3/goingGolfing.csv")
LetsGoGolfing = str(f.read().decode('utf-8'))
for row in LetsGoGolfing.split("\n")[0:5]:
  print (row)

DATE,PRCP,SNOW,TMAX,TMIN
2010-01-01,0.07,0.9,32,25
2010-01-02,0,0,37,18
2010-01-03,0,0,20,12
2010-01-04,0,0,21,13


date,golfer,played
2017-01-01,Charlotte,0
2017-01-01,Brad,0
2017-01-01,Kyle,0
2017-01-01,Alexander,0

Now adding the data to our database. This will create two tables:


*   stateCollege
*   golfingData

The ER Diagram:

![ER Diagram](https://raw.githubusercontent.com/dudaspm/IST210/master/Introduction/Images/goinggolfing.png)

In [3]:
%%sql  
DROP TABLE IF EXISTS stateCollege;
CREATE TABLE stateCollege(date text primary key, precipitation real, snow real, temp_max integer, temp_min integer);

DROP TABLE IF EXISTS golfingData;
create table golfingData (date text, name text, golfing int, PRIMARY KEY (date, name));

 * sqlite:///letsgogolfing.db
Done.
Done.
Done.
Done.

[]

These are used to put data into our tables. 

(Note, these may take a few moments to complete)

In [0]:
%%capture
for line in StateCollegeWeatherData.split("\n")[1:]:
  d = line.split(",")
  date = d[0]
  precipitation = d[1]
  snow = d[2]
  temp_max = d[3]
  temp_min = d[4]
  
  # Example:
  # INSERT INTO stateCollege VALUES('2010-01-01',.07,.9,32,25)
  %sql insert into stateCollege values (:date,:precipitation,:snow,:temp_max,:temp_min)

In [0]:
%%capture
for line in LetsGoGolfing.split("\n")[1:]:
  d = line.split(",")
  date = d[0]
  name = d[1]
  golfing = d[2]
  
  # Example:
  # INSERT INTO golfingData VALUES('2017-01-01','Charlotte',0)
  %sql insert into golfingData values (:date,:name,:golfing)

In [26]:
%%sql
select * from stateCollege limit 5

 * sqlite:///letsgogolfing.db
Done.

[('2010-01-01', 0.07, 0.9, 32, 25),
 ('2010-01-02', 0.0, 0.0, 37, 18),
 ('2010-01-03', 0.0, 0.0, 20, 12),
 ('2010-01-04', 0.0, 0.0, 21, 13),
 ('2010-01-05', 0.0, 0.0, 25, 18)]

In [28]:
%%sql
select * from golfingData limit 15

 * sqlite:///letsgogolfing.db
Done.

[('2017-01-01', 'Charlotte', 0),
 ('2017-01-01', 'Brad', 0),
 ('2017-01-01', 'Kyle', 0),
 ('2017-01-01', 'Alexander', 0),
 ('2017-01-01', 'Susan', 0),
 ('2017-01-01', 'Olivia', 0),
 ('2017-01-01', 'Oscar', 1),
 ('2017-01-01', 'Isabella', 0),
 ('2017-01-01', 'Pranav', 0),
 ('2017-01-01', 'Jenay', 1),
 ('2017-01-02', 'Charlotte', 0),
 ('2017-01-02', 'Brad', 0),
 ('2017-01-02', 'Kyle', 0),
 ('2017-01-02', 'Alexander', 0),
 ('2017-01-02', 'Susan', 1)]

### count - counting

Give the SQL Query that answers the following question:
How many golfers are there?

In [8]:
%%sql
select count(*) from golfingData

 * sqlite:///letsgogolfing.db
Done.

[(10110,)]

### distinct - get all distinct or unique values

In [9]:
%%sql
select count(distinct(name)) from golfingData

 * sqlite:///letsgogolfing.db
Done.

[(10,)]

What does this mean in words?

Your answer:

### AVG - Average

In [10]:
%%sql
select avg(temp_min) from stateCollege

 * sqlite:///letsgogolfing.db
Done.

[(42.54463307776561,)]

What does this mean in words?

Your answer:

### Between

In [29]:
%%sql
select avg(temp_max) from stateCollege where date between "2019-09-01" and "2019-09-30"

 * sqlite:///letsgogolfing.db
Done.

[(75.83333333333333,)]

What does this mean in words?

Your answer:

### LIKE - With text, finding words/phrases

In [12]:
%%sql
select distinct(name) from golfingData where name like "Br%"

 * sqlite:///letsgogolfing.db
(sqlite3.OperationalError) unrecognized token: ""Br%"
[SQL: select distinct(name) from golfingData where name like "Br%]
(Background on this error at: http://sqlalche.me/e/e3q8)

What does this mean in words?

Your answer:

#### Group by - group results by a certain attribute

In [13]:
%%sql
select name, avg(golfing) from golfingData group by name

 * sqlite:///letsgogolfing.db
Done.

[('Alexander', 0.5459940652818991),
 ('Brad', 0.5588526211671613),
 ('Charlotte', 0.5519287833827893),
 ('Isabella', 0.5499505440158259),
 ('Jenay', 0.543026706231454),
 ('Kyle', 0.5677546983184966),
 ('Olivia', 0.5657764589515332),
 ('Oscar', 0.5361028684470821),
 ('Pranav', 0.5479723046488625),
 ('Susan', 0.5400593471810089)]

What does this mean in words?

Your answer:

In [14]:
%%sql
select name, avg(golfing) from golfingData where name like "%an%" group by name

 * sqlite:///letsgogolfing.db
Done.

[('Alexander', 0.5459940652818991),
 ('Pranav', 0.5479723046488625),
 ('Susan', 0.5400593471810089)]

What does this mean in words?

Your answer:

### Order by - order the results by a certain attribute

In [15]:
%%sql
select * from stateCollege order by temp_max limit 10

 * sqlite:///letsgogolfing.db
Done.

[('2014-01-08', 0.0, 0.0, 6, -8),
 ('2015-02-16', 0.0, 0.0, 6, -7),
 ('2014-01-29', 0.0, 0.0, 8, -3),
 ('2015-02-20', 0.0, 0.0, 8, -8),
 ('2015-02-17', 0.06, 0.9, 9, -7),
 ('2018-01-06', 0.0, 0.0, 9, 1),
 ('2018-01-07', 0.0, 0.0, 9, -1),
 ('2016-02-14', 0.0, 0.0, 10, 2),
 ('2019-01-22', 0.0, 0.0, 10, -1),
 ('2019-02-01', 0.0, 0.0, 10, -4)]

In [16]:
%%sql
select * from stateCollege order by temp_max DESC limit 10

 * sqlite:///letsgogolfing.db
Done.

[('2011-07-23', 0.0, 0.0, 101, 77),
 ('2011-07-22', 0.0, 0.0, 99, 76),
 ('2012-07-08', 0.08, 0.0, 97, 73),
 ('2011-07-21', 0.0, 0.0, 95, 72),
 ('2010-07-06', 0.0, 0.0, 94, 69),
 ('2010-07-09', 0.0, 0.0, 94, 72),
 ('2012-07-18', 0.0, 0.0, 94, 71),
 ('2010-07-07', 0.0, 0.0, 93, 70),
 ('2010-07-08', 0.0, 0.0, 93, 70),
 ('2010-07-24', 0.33, 0.0, 93, 72)]

What does this mean in words?

Your answer:

## Joins

Up to this point, we have had a single table, but what if we had more than 1?

This is where joining comes into play. There are mutliple ways to join tables, but for now we are going to focus on just joining two tables.

#### Step 1: calling both tables.

In [17]:
%%sql
select * from stateCollege, golfingData limit 15

 * sqlite:///letsgogolfing.db
Done.

[('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-01', 'Charlotte', 0),
 ('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-01', 'Brad', 0),
 ('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-01', 'Kyle', 0),
 ('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-01', 'Alexander', 0),
 ('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-01', 'Susan', 0),
 ('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-01', 'Olivia', 0),
 ('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-01', 'Oscar', 1),
 ('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-01', 'Isabella', 0),
 ('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-01', 'Pranav', 0),
 ('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-01', 'Jenay', 1),
 ('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-02', 'Charlotte', 0),
 ('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-02', 'Brad', 0),
 ('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-02', 'Kyle', 0),
 ('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-02', 'Alexander', 0),
 ('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-02', 'Susan', 1)]

Let's give the tables a nickname.

In [18]:
%%sql
select * from stateCollege s, golfingData g limit 15

 * sqlite:///letsgogolfing.db
Done.

[('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-01', 'Charlotte', 0),
 ('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-01', 'Brad', 0),
 ('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-01', 'Kyle', 0),
 ('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-01', 'Alexander', 0),
 ('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-01', 'Susan', 0),
 ('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-01', 'Olivia', 0),
 ('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-01', 'Oscar', 1),
 ('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-01', 'Isabella', 0),
 ('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-01', 'Pranav', 0),
 ('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-01', 'Jenay', 1),
 ('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-02', 'Charlotte', 0),
 ('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-02', 'Brad', 0),
 ('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-02', 'Kyle', 0),
 ('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-02', 'Alexander', 0),
 ('2010-01-01', 0.07, 0.9, 32, 25, '2017-01-02', 'Susan', 1)]

#### Step 2: connecting the tables

Looking at our data, what is the commmonality between the two tables? 

Once we know this, we need to join the two tables based on this commonality using a WHERE command.

In [19]:
%%sql
select * from stateCollege s, golfingData g WHERE s.date = g.date limit 15

 * sqlite:///letsgogolfing.db
Done.

[('2017-01-01', 0.01, 0.0, 40, 27, '2017-01-01', 'Charlotte', 0),
 ('2017-01-01', 0.01, 0.0, 40, 27, '2017-01-01', 'Brad', 0),
 ('2017-01-01', 0.01, 0.0, 40, 27, '2017-01-01', 'Kyle', 0),
 ('2017-01-01', 0.01, 0.0, 40, 27, '2017-01-01', 'Alexander', 0),
 ('2017-01-01', 0.01, 0.0, 40, 27, '2017-01-01', 'Susan', 0),
 ('2017-01-01', 0.01, 0.0, 40, 27, '2017-01-01', 'Olivia', 0),
 ('2017-01-01', 0.01, 0.0, 40, 27, '2017-01-01', 'Oscar', 1),
 ('2017-01-01', 0.01, 0.0, 40, 27, '2017-01-01', 'Isabella', 0),
 ('2017-01-01', 0.01, 0.0, 40, 27, '2017-01-01', 'Pranav', 0),
 ('2017-01-01', 0.01, 0.0, 40, 27, '2017-01-01', 'Jenay', 1),
 ('2017-01-02', 0.02, 0.0, 43, 30, '2017-01-02', 'Charlotte', 0),
 ('2017-01-02', 0.02, 0.0, 43, 30, '2017-01-02', 'Brad', 0),
 ('2017-01-02', 0.02, 0.0, 43, 30, '2017-01-02', 'Kyle', 0),
 ('2017-01-02', 0.02, 0.0, 43, 30, '2017-01-02', 'Alexander', 0),
 ('2017-01-02', 0.02, 0.0, 43, 30, '2017-01-02', 'Susan', 1)]

Also, this looks somewhat familiar.

![ER Diagram](https://raw.githubusercontent.com/dudaspm/IST210/master/Introduction/Images/goinggolfing.png)

The difference between these two commands can also be shown as followed:

In [20]:
%%sql
select count(*) from stateCollege s, golfingData g limit 10;

 * sqlite:///letsgogolfing.db
Done.

[(36921720,)]

In [21]:
%%sql
select count(*) from stateCollege s, golfingData g WHERE s.date = g.date limit 10;

 * sqlite:///letsgogolfing.db
Done.

[(10110,)]

So, the table are now joined... So what.

#### Step 3: Accessing the attributes.

We still have a bit of redudancy. The date is listed twice. What if we want to see it once.

In [22]:
%%sql
select s.date, s.precipitation, s.snow, s.temp_max, s.temp_min, g.name, g.golfing from stateCollege as s, golfingData as g WHERE s.date = g.date limit 15

 * sqlite:///letsgogolfing.db
Done.

[('2017-01-01', 0.01, 0.0, 40, 27, 'Charlotte', 0),
 ('2017-01-01', 0.01, 0.0, 40, 27, 'Brad', 0),
 ('2017-01-01', 0.01, 0.0, 40, 27, 'Kyle', 0),
 ('2017-01-01', 0.01, 0.0, 40, 27, 'Alexander', 0),
 ('2017-01-01', 0.01, 0.0, 40, 27, 'Susan', 0),
 ('2017-01-01', 0.01, 0.0, 40, 27, 'Olivia', 0),
 ('2017-01-01', 0.01, 0.0, 40, 27, 'Oscar', 1),
 ('2017-01-01', 0.01, 0.0, 40, 27, 'Isabella', 0),
 ('2017-01-01', 0.01, 0.0, 40, 27, 'Pranav', 0),
 ('2017-01-01', 0.01, 0.0, 40, 27, 'Jenay', 1),
 ('2017-01-02', 0.02, 0.0, 43, 30, 'Charlotte', 0),
 ('2017-01-02', 0.02, 0.0, 43, 30, 'Brad', 0),
 ('2017-01-02', 0.02, 0.0, 43, 30, 'Kyle', 0),
 ('2017-01-02', 0.02, 0.0, 43, 30, 'Alexander', 0),
 ('2017-01-02', 0.02, 0.0, 43, 30, 'Susan', 1)]

Now we can ask more questions of data based on having both datasets.

What does this next query give us?

In [23]:
%%sql
select g.name, sum(g.golfing) from stateCollege as s, golfingData as g WHERE s.date = g.date AND s.temp_min < 30 group by g.name limit 10

 * sqlite:///letsgogolfing.db
Done.

[('Alexander', 49),
 ('Brad', 53),
 ('Charlotte', 43),
 ('Isabella', 46),
 ('Jenay', 48),
 ('Kyle', 45),
 ('Olivia', 60),
 ('Oscar', 36),
 ('Pranav', 42),
 ('Susan', 42)]

Your answer:

Ok, try and answer the following question.  

Did anyone go golfing when it was snowing?

In [24]:
%%sql
select * from stateCollege limit 10

 * sqlite:///letsgogolfing.db
Done.

[('2010-01-01', 0.07, 0.9, 32, 25),
 ('2010-01-02', 0.0, 0.0, 37, 18),
 ('2010-01-03', 0.0, 0.0, 20, 12),
 ('2010-01-04', 0.0, 0.0, 21, 13),
 ('2010-01-05', 0.0, 0.0, 25, 18),
 ('2010-01-06', 0.05, 0.7, 27, 18),
 ('2010-01-07', 0.0, 0.0, 30, 25),
 ('2010-01-08', 0.06, 1.2, 29, 21),
 ('2010-01-09', 0.02, 0.4, 24, 16),
 ('2010-01-10', 0.0, 0.0, 27, 8)]

List of functions:


*   INSERT
*   CREATE
*   UPDATE
*   DROP
*   Distinct
*   Count
*   AVG
*   SUM
*   Group By
*   Order By
*   Between
*   LIKE 
*   Join